Pointing Keycloak Dev to my local config yields this plan:

<details><summary>Details</summary>

```
OpenTofu will perform the following actions:

  # aws_route53_record.keycloak_dev_admin_hostname will be created
  + resource "aws_route53_record" "keycloak_dev_admin_hostname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "keycloak-dev-admin.mbtace.com"
      + type            = "A"
      + zone_id         = "Z1AA3G2R9U83OO"

      + alias {
          + evaluate_target_health = false
          + name                   = "keycloak-dev-alb-922486372.us-east-1.elb.amazonaws.com"
          + zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

  # module.keycloak-dev.aws_alb.keycloak-load-balancer will be updated in-place
  ~ resource "aws_alb" "keycloak-load-balancer" {
      ~ drop_invalid_header_fields                  = false -> true
      ~ enable_deletion_protection                  = false -> true
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:434035161053:loadbalancer/app/keycloak-dev-alb/5cc418241cfddcdb"
        name                                        = "keycloak-dev-alb"
      ~ security_groups                             = [
          - "sg-0f2c621be626574bb",
        ] -> (known after apply)
        tags                                        = {
            "Project"              = "keycloak-dev"
            "TerraformEnvironment" = "aws-tid-main-base"
        }
        # (22 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.keycloak-dev.aws_db_instance.keycloak-database-engine will be updated in-place
  ~ resource "aws_db_instance" "keycloak-database-engine" {
      + allow_major_version_upgrade           = false
      ~ copy_tags_to_snapshot                 = false -> true
      ~ deletion_protection                   = false -> true
        id                                    = "db-BWALTMRXYH7FOD2LJJCJYGOJCM"
      ~ password_wo                           = (write-only attribute)
        tags                                  = {
            "Project"              = "keycloak-dev"
            "TerraformEnvironment" = "aws-tid-main-base"
        }
      ~ vpc_security_group_ids                = [
          - "sg-0e8a1c11dbf9814ca",
        ] -> (known after apply)
        # (55 unchanged attributes hidden)
    }

  # module.keycloak-dev.aws_ecs_service.keycloak-service will be updated in-place
  ~ resource "aws_ecs_service" "keycloak-service" {
        id                                 = "arn:aws:ecs:us-east-1:434035161053:service/keycloak/keycloak-dev"
        name                               = "keycloak-dev"
        tags                               = {
            "Project"              = "keycloak-dev"
            "TerraformEnvironment" = "aws-tid-main-base"
        }
        # (20 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-04c71b3bfbae2ad50",
              - "sg-0f2c621be626574bb",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.keycloak-dev.aws_ecs_task_definition.keycloak-ecs-taskdef must be replaced
+/- resource "aws_ecs_task_definition" "keycloak-ecs-taskdef" {
      ~ arn                      = "arn:aws:ecs:us-east-1:434035161053:task-definition/keycloak-dev-template:24" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:434035161053:task-definition/keycloak-dev-template" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "KC_DB_URL_HOST"
                            value = "keycloak-dev.cw84s0ixvuei.us-east-1.rds.amazonaws.com:3306"
                        },
                      ~ {
                            name  = "KC_DB_URL_PROPERTIES"
                          ~ value = "?autoReconnect=true" -> "?autoReconnect=true&sslMode=trust"
                        },
                        {
                            name  = "KC_DB_USERNAME"
                            value = "keycloak"
                        },
                        {
                            name  = "KC_HEALTH_ENABLED"
                            value = "true"
                        },
                      ~ {
                          ~ name  = "KC_HOSTNAME_STRICT" -> "KC_HOSTNAME"
                          ~ value = "false" -> "https://login-dev.mbtace.com/auth"
                        },
                      ~ {
                          ~ name  = "KC_HTTP_ENABLED" -> "KC_HOSTNAME_ADMIN"
                          ~ value = "true" -> "https://keycloak-dev-admin.mbtace.com/auth"
                        },
                      ~ {
                          ~ name  = "KC_HTTP_RELATIVE_PATH" -> "KC_HOSTNAME_STRICT"
                          ~ value = "/auth" -> "true"
                        },
                      ~ {
                          ~ name  = "KC_LOG_LEVEL" -> "KC_HTTP_ENABLED"
                          ~ value = "INFO,cz.integsoft:DEBUG,org.infinispan:DEBUG,org.jgroups:DEBUG" -> "true"
                        },
                      - {
                          - name  = "KC_PROXY"
                          - value = "edge"
                        },
                      - {
                          - name  = "KC_PROXY_HEADERS"
                          - value = "xforwarded"
                        },
                      - {
                          - name  = "KEYCLOAK_ADMIN"
                          - value = "keycloak-mbta-admin"
                        },
                      - {
                          - name  = "QUARKUS_HTTP_ACCESS_LOG_CONSOLIDATE_REROUTED_REQUESTS"
                          - value = "true"
                        },
                      - {
                          - name  = "QUARKUS_HTTP_ACCESS_LOG_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "QUARKUS_HTTP_ACCESS_LOG_PATTERN"
                          - value = "%t [%{i,X-Forwarded-For}, %h] %l (user:%u) - '%r' => %s (%b bytes) '%{i,User-Agent}' (Referer '%{i,Referer}') - [%I, %Dms]"
                        },
                      - {
                          - name  = "QUARKUS_HTTP_RECORD_REQUEST_START_TIME"
                          - value = "true"
                        },
                      + {
                          + name  = "KC_HTTP_RELATIVE_PATH"
                          + value = "/auth"
                        },
                      + {
                          + name  = "KC_LOG_LEVEL"
                          + value = "INFO,cz.integsoft:DEBUG,org.infinispan:DEBUG,org.jgroups:DEBUG"
                        },
                      + {
                          + name  = "KC_PROXY_HEADERS"
                          + value = "xforwarded"
                        },
                      + {
                          + name  = "KC_PROXY_HEADERS"
                          + value = "xforwarded"
                        },
                      + {
                          + name  = "KC_SPI_STICKY_SESSION_ENCODER__INFINISPAN__SHOULD_ATTACH_ROUTE"
                          + value = "false"
                        },
                      + {
                          + name  = "KEYCLOAK_ADMIN"
                          + value = "keycloak-mbta-admin"
                        },
                      + {
                          + name  = "QUARKUS_HTTP_ACCESS_LOG_CONSOLIDATE_REROUTED_REQUESTS"
                          + value = "true"
                        },
                      + {
                          + name  = "QUARKUS_HTTP_ACCESS_LOG_ENABLED"
                          + value = "true"
                        },
                      + {
                          + name  = "QUARKUS_HTTP_ACCESS_LOG_PATTERN"
                          + value = "%t [%{i,X-Forwarded-For}, %h] %l (user:%u) - '%r' => %s (%b bytes) '%{i,User-Agent}' (Referer '%{i,Referer}') - [%I, %Dms]"
                        },
                      + {
                          + name  = "QUARKUS_HTTP_RECORD_REQUEST_START_TIME"
                          + value = "true"
                        },
                    ]
                  - mountPoints      = []
                    name             = "keycloak-dev"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ execution_role_arn       = "arn:aws:iam::434035161053:role/keycloak-dev-ecs-execution-task-role" -> "arn:aws:iam::434035161053:role/keycloak-dev-ecs-execution-role" # forces replacement
      ~ id                       = "keycloak-dev-template" -> (known after apply)
      ~ revision                 = 24 -> (known after apply)
        tags                     = {
            "Project"              = "keycloak-dev"
            "TerraformEnvironment" = "aws-tid-main-base"
        }
      ~ task_role_arn            = "arn:aws:iam::434035161053:role/keycloak-dev-ecs-execution-task-role" -> "arn:aws:iam::434035161053:role/keycloak-dev-ecs-task-role" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.keycloak-dev.aws_iam_role.keycloak-ecs-execution-task-role will be destroyed
  # (because aws_iam_role.keycloak-ecs-execution-task-role is not in configuration)
  - resource "aws_iam_role" "keycloak-ecs-execution-task-role" {
      - arn                   = "arn:aws:iam::434035161053:role/keycloak-dev-ecs-execution-task-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-15T20:29:01Z" -> null
      - force_detach_policies = false -> null
      - id                    = "keycloak-dev-ecs-execution-task-role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "keycloak-dev-ecs-execution-task-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Project"              = "keycloak-dev"
          - "TerraformEnvironment" = "aws-tid-main-base"
        } -> null
      - tags_all              = {
          - "Project"              = "keycloak-dev"
          - "TerraformEnvironment" = "aws-tid-main-base"
        } -> null
      - unique_id             = "AROAWKDUC67OWODAMEDRO" -> null
    }

  # module.keycloak-dev.aws_security_group.database-sg must be replaced
+/- resource "aws_security_group" "database-sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:434035161053:security-group/sg-0e8a1c11dbf9814ca" -> (known after apply)
      ~ description            = "Managed by Terraform" -> "Inbound connections to the Keycloak database" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0e8a1c11dbf9814ca" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "MariaDB port"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-04c71b3bfbae2ad50",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = "MariaDB port"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      ~ name                   = "keycloak-dev-database-sg" -> (known after apply)
      + name_prefix            = "keycloak-dev-database-sg" # forces replacement
      ~ owner_id               = "434035161053" -> (known after apply)
      ~ tags                   = {
          + "Name"                 = "keycloak-dev-database-sg"
            "Project"              = "keycloak-dev"
            "TerraformEnvironment" = "aws-tid-main-base"
        }
      ~ tags_all               = {
          + "Name"                 = "keycloak-dev-database-sg"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.keycloak-dev.aws_security_group.keycloak-load-balancer-sg must be replaced
+/- resource "aws_security_group" "keycloak-load-balancer-sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:434035161053:security-group/sg-0f2c621be626574bb" -> (known after apply)
      ~ description            = "Managed by Terraform" -> "Security group for the Keycloak loadbalancer" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0f2c621be626574bb" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow incoming HTTPS traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      ~ name                   = "keycloak-dev-load-balancer-sg" -> (known after apply)
      + name_prefix            = "keycloak-dev-load-balancer-sg" # forces replacement
      ~ owner_id               = "434035161053" -> (known after apply)
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "Name"                 = "keycloak-dev-load-balancer-sg"
            "Project"              = "keycloak-dev"
            "TerraformEnvironment" = "aws-tid-main-base"
        }
      ~ tags_all               = {
          + "Name"                 = "keycloak-dev-load-balancer-sg"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.keycloak-dev.aws_security_group.keycloak-sg must be replaced
+/- resource "aws_security_group" "keycloak-sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:434035161053:security-group/sg-04c71b3bfbae2ad50" -> (known after apply)
      ~ description            = "Managed by Terraform" -> "Security group for Keycloak tasks" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow external traffic to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-04c71b3bfbae2ad50" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow incoming requests from the loadbalancer"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0f2c621be626574bb",
                ]
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow incoming requests from the loadbalancer"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
      ~ name                   = "keycloak-dev-sg" -> (known after apply)
      + name_prefix            = "keycloak-dev-sg" # forces replacement
      ~ owner_id               = "434035161053" -> (known after apply)
      ~ tags                   = {
          + "Name"                 = "keycloak-dev-sg"
            "Project"              = "keycloak-dev"
            "TerraformEnvironment" = "aws-tid-main-base"
        }
      ~ tags_all               = {
          + "Name"                 = "keycloak-dev-sg"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.keycloak-dev.aws_vpc_security_group_egress_rule.keycloak_load_balancer_sg will be created
  + resource "aws_vpc_security_group_egress_rule" "keycloak_load_balancer_sg" {
      + arn                          = (known after apply)
      + description                  = "Allow traffic to Keycloak tasks"
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 9090
    }

Plan: 6 to add, 3 to change, 5 to destroy.
```

</details> 